{
    "Accessibility": "The practice of making your websites usable by as many people as&nbsp;possible.",
    "Adaptive designs": "Adaptive designs are a range of pre-made layouts that fit different screen sizes. The device's browser selects the best-fitting design from those&nbsp;options.",
    "Affordance": "Designing elements that suggest their&nbsp;functionality.",
    "ARIA": "Accessible&nbsp;Rich&nbsp;Internet&nbsp;Applications; a set of attributes that define ways to make web content more&nbsp;accessible.",
    "ATIP": "Access to Information and Privacy",
    "aXe": "An accessibility testing tool to help ensure your web applications are accessible to people with&nbsp;disabilities.",
    "BPA": "Bureau of Pensions Advocates",
    "CAF": "Canadian Armed Forces",
    "Card sorting": "Card sorting is a user research method that helps designers understand how users categorize and organize information. Participants categorize content on index cards, physically or&nbsp;digitally.",
    "CSA": "Client Services Application",
    "CSDN": "Client Service Delivery Network",
    "Cognitive load": "The total amount of mental effort being used in the working memory. Minimizing cognitive load involves creating intuitive interfaces that don't overwhelm users with excessive information or complex&nbsp;tasks.",
    "Dark theme": "A dark theme is a low-light UI that displays mostly dark surfaces.",
    "Dark pattern": "Design practices that intentionally deceive or manipulate users into taking actions they might not have taken otherwise. Examples include tricking users into subscribing to newsletters, making it hard to cancel subscriptions, or hiding important&nbsp;information.",
    "Design tokens": "A design token represents a small, reusable design decision that’s part of a design system's visual style. Tokens replace static values with self&#8209;explanatory&nbsp;names.",
    "Discoverability": "The ease with which users can find and understand how to use features or content within an&nbsp;interface.",
    "DND": "Department of National Defense",
    "ETB": "Education and Training Benefit",
    "FHCPS": "Federal Health Claims Processing Service",
    "Figma": "Collaborative design tool for creating UI designs and&nbsp;prototypes.",
    "Federal Identity Program": "Requirements concerning the use and display of the official symbols of the Government&nbsp;of&nbsp;Canada.",
    "Hierarchy": "Organizing content based on importance to guide user&nbsp;attention.",
    "HRT": "Health Related Travel",
    "IRB": "Income Replacement Benefit",
    "GCWeb": "The Canada.ca design system theme for Web Experience Toolkit (WET)",
    "Gestalt principles": "Principles like proximity, similarity, and closure in&nbsp;design.",
    "Human-Computer Interaction (HCI)": "Study of how people interact with&nbsp;computers.",
    "Information Architecture (IA)": "Organizing and structuring content for intuitive&nbsp;navigation.",
    "Interaction Design (IxD)": "Designing how users interact with digital&nbsp;products.",
    "Material Design": "A design language developed by Google that uses grid-based layouts, responsive animations, and depth effects such as lighting and shadows to create a clean and consistent user experience across different devices and&nbsp;platforms.",
    "Mental models": "Mental models are representations of the world that help us understand complex concepts and make better&nbsp;decisions.",
    "Mockups": "Mockups are models designers use to present, demonstrate, test and improve their&nbsp;concepts.",
    "Navigation rail": "A component providing access to primary destinations in apps when using tablet and desktop screens.",
    "NCCN": "National Contact Centre Network",
    "OSD": "Online Services Directorate",
    "Progressive disclosure": "Revealing complex information gradually to users.",
    "Prototyping": "Creating interactive models for user testing and&nbsp;feedback.",
    "Semantic HTML": "Using HTML elements to reinforce the meaning of information in web pages and web&nbsp;applications.",
    "Stakeholder": "Any individual, group, or organization that has an interest or concern in a project and can affect or be affected by its outcomes. In UX/UI design, stakeholders often include users, clients, team members, investors, and anyone else with a vested interest in the success of the&nbsp;project.",
    "System Usability Score": "A scale for assessing a user's perceived&nbsp;usability.",
    "Top app bar": "A component that displays information and actions at the top of a screen.",
    "Tree testing": "Tree testing evaluates how easy a website is to navigate. Participants are asked to navigate to a specific page on a website using only page names in a&nbsp;menu.",
    "Typography": "Choosing and using fonts effectively for readability and&nbsp;style.",
    "UI Components": "Reusable elements like buttons, forms, and navigation&nbsp;bars.",
    "Usability": "The ease of use and learnability of a&nbsp;product.",
    "Usability Testing": "Testing user-friendliness by observing use&nbsp;interactions.",
    "User Experience (UX)": "User Experience encompasses all aspects of the end-user's interaction with the company, its services, and its&nbsp;products.",
    "User Flows": "Visual representations of how users navigate through a&nbsp;product.",
    "User Journey": "Mapping out the steps users take to achieve a goal within a&nbsp;product.",
    "User Persona": "A fictional representation of a user based on research&nbsp;data.",
    "User Research": "Methods like interviews, surveys, and testing to understand user&nbsp;needs.",
    "VRAB": "Veterans Review & Appeal Board",
    "WAVE": "Web Accessibility Evaluation Tool; a suite of evaluation tools that help authors make their web content more accessible to individuals with disabilities.",
    "WET": "Web Experience Toolkit; a front-end framework led by the Government&nbsp;of&nbsp;Canada for building websites that are accessible, usable, interoperable, mobile friendly and&nbsp;multilingual.",
    "Wireframes": "Basic layouts outlining page structure and content&nbsp;placement."
}